/****************************************************************
 *																*		
 * 						      代码库							*
 *                        www.dmaku.com							*
 *       		  努力创建完善、持续更新插件以及模板			*
 * 																*
****************************************************************/
/*
 ----------------------------------------------------------------------
 Preloader
 ----------------------------------------------------------------------
 */
$(window).load(function() {

    "use strict";

    $(".loader").delay(400).fadeOut();
    $(".animationload").delay(400).fadeOut("fast");

});

/*
 ----------------------------------------------------------------------
 Nice scroll
 ----------------------------------------------------------------------
 */
$("html").niceScroll({
    cursorcolor: '#fff',
    cursoropacitymin: '0',
    cursoropacitymax: '1',
    cursorwidth: '2px',
    zindex: 999999,
    horizrailenabled: false,
    enablekeyboard: false
});
